xrun: 22.03-s012: (c) Copyright 1995-2023 Cadence Design Systems, Inc.
TOOL:	xrun	22.03-s012: Started on Jan 27, 2025 at 18:38:51 CST
xrun
	-f xrun.f
		-incdir /home/grads/t/tscotti24/labs/lab-1-Ty700/examples/sim/rtl
		-define ABVIP_SIM
		/home/grads/t/tscotti24/labs/lab-1-Ty700/examples/sim/rtl/apb_master.v
		/home/grads/t/tscotti24/labs/lab-1-Ty700/examples/sim/rtl/apb3_monitor.sv
		/home/grads/t/tscotti24/labs/lab-1-Ty700/examples/sim/top.v
		-input /home/grads/t/tscotti24/labs/lab-1-Ty700/examples/sim/xrun.tcl
		-sv
		-top top
		-access rwc
		-assert
		-coverage A
		-covoverwrite
		-covfile ./cov_conf.ccf
	Elaborating the design hierarchy:
		Caching library 'worklib' ....... Done
	Top level design units:
		top
xmelab: *W,DSEMEL: This SystemVerilog design will be simulated as per IEEE 1800-2009 SystemVerilog simulation semantics. Use -disable_sem2009 option for turning off SV 2009 simulation semantics.

	Extracting FSMs for coverage:
		worklib.apb_master
			FSM extracted for state register state
		worklib.apb3_monitor
		worklib.top
	Total FSMs extracted = 1
	Building instance overlay tables: .............
xmelab: *W,COVFHT: FSM hold transitions (transitions to the current state) are not extracted for any FSM in default mode.
....... Done
	Enabling instrumentation for coverage types: block expression FSM toggle functional
xmelab: *W,COVDCL: By default expression coverage is scored only for Verilog logical operators (|| and &&) and VHDL logical operators (OR, AND, NOR, and NAND), and is scored only in condition expressions. To score coverage for other operators and for expressions in other statements, use the "set_expr_coverable_operators" and "set_expr_coverable_statements" coverage configuration file commands with suitable options at elaboration.
	Generating native compiled code:
		worklib.apb3_monitor:sv <0x64fd852b>
			streams: 167, words: 106864
		worklib.apb_master:v <0x1278550b>
			streams:  25, words: 29857
		worklib.top:v <0x04b607a5>
			streams:  11, words: 21807
xmelab: *W,COVNOEN: By default, toggle coverage is not supported for systemverilog enumerated nets and variables. To enable toggle coverage of these objects, specify the 'set_toggle_scoring -sv_enum' command in the coverage configuration file.
	Building instance specific data structures.
xmelab: *W,CGPIDF: Covergroup "per_instance" option , by default, is set as 0.
	Loading native compiled code:     .................... Done
	Design hierarchy summary:
		                 Instances  Unique
		Modules:                 3       3
		Registers:             216     265
		Scalar wires:           21       -
		Vectored wires:         13       -
		Named events:            2       2
		Always blocks:         121     154
		Initial blocks:         42      57
		Clocking blocks:         1       1
		Cont. assignments:      16      33
		Pseudo assignments:      6       6
		Assertions:             36      48
		Covergroup Instances:    0       1
	Writing initial simulation snapshot: worklib.top:v
Loading snapshot worklib.top:v .................... Done
xmsim: *W,DSEM2009: This SystemVerilog design is simulated as per IEEE 1800-2009 SystemVerilog simulation semantics. Use -disable_sem2009 option for turning off SV 2009 simulation semantics.
xcelium> source /opt/coe/cadence/XCELIUM/tools/xcelium/files/xmsimrc
xcelium> #database -open tr_db -into tr_db -event -default
xcelium> #probe -create -shm top -all -depth all
xcelium> database -open waves -into waves.shm -event -default
Created default SHM database waves
xcelium> probe -create top -all -memories -depth all -tasks -functions -all -database waves -waveform
Created probe 1
xcelium> run 500 ns
  ABVIP Version: 11.30-s098
-------------------------------------------------------------
Cadence AMBA APB 3 Assertion Monitor Configuration
  Module:   worklib.apb3_monitor
  Instance: top.apb_checker
  ABUS_WIDTH:                32
  DBUS_WIDTH:                32
  COVERAGE_ON:                1
  COVERGROUPS_ON:             1
  MAX_WAIT_CYCLES_ON:         0
  RST_CHECKS_ON:              0
  RECM_CHECKS_ON:             1
  XCHECKS_ON:                 0
-------------------------------------------------------------
Ran until 500 NS + 0
xcelium> assertion -summary
  Disabled Finish Failed   Assertion Name 
         1      2      0   top.apbMaster.assert_rdata_check_not_sys_ready
         1      0      0   top.apbMaster.assert_rdata_check_sys_ready
         1      1      0   top.apb_checker.genCov.cover_access_after_setup_state
         1      1      0   top.apb_checker.genCov.cover_access_state
         1      0      0   top.apb_checker.genCov.cover_burst_of_read_transfers
         1      0      0   top.apb_checker.genCov.cover_burst_of_write_transfers
         1      1      0   top.apb_checker.genCov.cover_idle_after_access_state
         1      1      0   top.apb_checker.genCov.cover_idle_after_idle_state
         1      1      0   top.apb_checker.genCov.cover_idle_state
         1      0      0   top.apb_checker.genCov.cover_read_after_write_transfer
         1      1      0   top.apb_checker.genCov.cover_read_transfer
         1      0      0   top.apb_checker.genCov.cover_setup_after_access_state
         1      1      0   top.apb_checker.genCov.cover_setup_after_idle_state
         1      1      0   top.apb_checker.genCov.cover_setup_state
         1      0      0   top.apb_checker.genCov.cover_write_after_read_transfer
         1      1      0   top.apb_checker.genCov.cover_write_transfer
         1      0      0   top.apb_checker.genCov.nnw.cover_read_transfer_with_wait_states
         1      1      0   top.apb_checker.genCov.nnw.cover_write_transfer_with_wait_states
         1      1      0   top.apb_checker.genLiveChks.slave_pready_eventually
         1      1      0   top.apb_checker.genRecmStbChks.master_idle_paddr_stable
         1      1      0   top.apb_checker.genRecmStbChks.master_idle_pwrite_stable
         1      1      0   top.apb_checker.genRecmTrnChks.slave_pslverr_last_access
         1      6      0   top.apb_checker.master_exit_access
         1     33      0   top.apb_checker.master_never_idle_to_access
         1      1      0   top.apb_checker.master_never_penable_first_clock
         1      1      0   top.apb_checker.master_never_penable_without_psel
         1      6      0   top.apb_checker.master_setup_paddr_stable
         1      6      0   top.apb_checker.master_setup_psel_stable
         1      4      0   top.apb_checker.master_setup_pwdata_stable
         1      6      0   top.apb_checker.master_setup_pwrite_stable
         1      6      0   top.apb_checker.master_setup_to_access
         1      2      0   top.apb_checker.stable_checks.master_access_paddr_stable
         1      2      0   top.apb_checker.stable_checks.master_access_penable_stable
         1      2      0   top.apb_checker.stable_checks.master_access_psel_stable
         1      2      0   top.apb_checker.stable_checks.master_access_pwdata_stable
         1      2      0   top.apb_checker.stable_checks.master_access_pwrite_stable
  Total Assertions = 36,  Failing Assertions = 0,  Unchecked Assertions = 7
  Assertion summary at time 500 NS + 0
xcelium> #exit
xcelium> exit

coverage setup:
  workdir  :  ./cov_work
  dutinst  :  top(top)
  scope    :  scope
  testname :  test

coverage files:
  model(design data) :  ./cov_work/scope/icc_0b2d1985_2e98073a.ucm
  data               :  ./cov_work/scope/test/icc_0b2d1985_2e98073a.ucd
TOOL:	xrun	22.03-s012: Exiting on Jan 27, 2025 at 18:38:57 CST  (total: 00:00:06)
